webservice/src/main/java/com/walterwhites/library/webservice/test/request_from_id.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="jaxb.consumer.library.walterwhites.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getBookFromIdRequest>
            <gs:id>100</gs:id>
        </gs:getBookFromIdRequest>
    </soapenv:Body>
</soapenv:Envelope>